app/controllers/books_controller.rb

SELECT `hist1s`.* FROM `hist1s`
---
  def show
   @book = Book.find(params[:id])
   @history = Hist1.all

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `hist1s`.* FROM `hist1s` ORDER BY `hist1s`.`id` DESC LIMIT 1
---
  def return
    @book = Book.find(params[:id])
    if @book.usertake == current_user.email
      @book.take = "Avaliable"
      @book.usertake = nil
      @book.save
      history = Hist1.last