app/controllers/books_controller.rb

SELECT  `books`.* FROM `books` LIMIT 20 OFFSET 0
SELECT  `books`.* FROM `books` ORDER BY rating DESC LIMIT 5
---
  def index
  	@books = Book.all.paginate(page: params[:page], per_page: 20)
    @top = Book.first_five

SELECT `hist1s`.* FROM `hist1s` WHERE `hist1s`.`book_id` = 14
SELECT `comments`.* FROM `comments` WHERE `comments`.`book_id` = 2
---
  def show
   @history = Hist1.where(book_id: @book.id)
   @comment1 = Comment.new
   @comment = Comment.where(book_id: @book.id)

INSERT INTO `books` (`name`, `rating`, `description`, `author`, `created_at`, `updated_at`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`) VALUES ('1234', 12, 'description 1', 'Author 1', '2017-10-19 20:03:56', '2017-10-19 20:03:56', '2.png', 'image/png', 579290, '2017-10-19 20:03:55')
---
  def create
   	@book = Book.new(book_params)
    @book.save

UPDATE `books` SET `name` = 'Book1', `author` = '3', `description` = 'FAfsafasf', `image_file_name` = '2.png', `image_content_type` = 'image/png', `image_file_size` = 579290, `image_updated_at` = '2017-10-20 09:05:50', `rating` = 0, `updated_at` = '2017-10-20 09:05:50' WHERE `books`.`id` = 1
---
  def update
    @book = @book.update_attributes(book_params)

DELETE FROM `books` WHERE `books`.`id` = 6
---
  def delete
    if @book.can_delete? current_user.email
      @book.destroy

UPDATE `books` SET `usertake` = 'alexalexis1@inbox.ru', `take` = 'Is taken by: ', `updated_at` = '2017-10-22 12:54:54' WHERE `books`.`id` = 2
INSERT INTO `hist1s` (`whotake`, `whentake`, `book_id`, `created_at`, `updated_at`) VALUES ('alexalexis12@inbox.ru', '2017-10-24 18:15:09 UTC', 13, '2017-10-24 18:15:15', '2017-10-24 18:15:15')
UPDATE `hist1s` SET `whentake` = '2017-10-22 13:25:33 UTC', `updated_at` = '2017-10-22 13:25:34' WHERE `hist1s`.`id` = 6
---
  def take
    if @book.can_take? current_user
      @book.update(take: 'Is taken by: ', usertake: current_user.email)
      Hist1.create(whotake: current_user.email, whentake: @book.updated_at,
        book_id: @book.id)

UPDATE `books` SET `usertake` = NULL, `take` = 'Avaliable', `updated_at` = '2017-10-22 13:16:34' WHERE `books`.`id` = 10
SELECT  `hist1s`.* FROM `hist1s` WHERE `hist1s`.`book_id` = 2 ORDER BY `hist1s`.`id` DESC LIMIT 1
UPDATE `hist1s` SET `whenreturn` = '2017-10-22 13:31:20 UTC', `updated_at` = '2017-10-22 13:31:20' WHERE `hist1s`.`id` = 8
---
  def return
    if @book.can_return? current_user.email
      @book.update(take: 'avaliable', usertake: nil)
      @history = Hist1.where(book_id: @book.id).last.update_attributes(whenreturn: @book.updated_at)

INSERT INTO `comments` (`book_id`, `username`, `usertext`, `created_at`, `updated_at`) VALUES (2, 'np.zaporoje.sb2@gmail.com', '[\"fsdfsd\"]', '2017-10-25 21:09:28', '2017-10-25 21:09:28')
---
  def create_comment
     @book_id = @book.id
     @comment = Comment.create(username: current_user.email, book_id: @book_id,
      usertext: params[:usertext])

SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 17 LIMIT 1
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 0 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 17
---
  def delete_comment
    @comment = Comment.find(params[:id])
    book1 = Book.find(@comment.book_id)
    @comment.destroy

SELECT  `books`.* FROM `books` WHERE `books`.`id` = NULL LIMIT 1
---
  def find_books
    @book = Book.find(params[:id])