app/controllers/comments_controller.rb

SELECT  `comments`.* FROM `comments` ORDER BY `comments`.`id` DESC LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 27
---
  def delete
  	@comment = Comment.last
    @comment.destroy